tap "hashicorp/tap"
tap "homebrew/services"
tap "mongodb/brew"
tap "universal-ctags/universal-ctags"
brew "automake"
brew "openssl@3"
brew "libssh2"
brew "bat"
brew "berkeley-db", link: true
brew "bottom"
brew "broot"
brew "glib"
brew "cheat"
brew "chezmoi"
brew "cmake"
brew "curl"
brew "direnv"
brew "docker"
brew "docutils"
brew "duf"
brew "dust"
brew "erlang"
brew "eza"
brew "fd"
brew "fzf"
brew "geckodriver"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "goenv"
brew "gron"
brew "harfbuzz"
brew "httpie"
brew "hub"
brew "jq"
brew "kubernetes-cli"
brew "libidn2"
brew "little-cms2"
brew "node"
brew "marp-cli"
brew "mise"
brew "mongosh"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nvm"
brew "openjdk"
brew "peco"
brew "perl"
brew "pre-commit"
brew "procs"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "r"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "screen"
brew "sd"
brew "selenium-server"
brew "starship"
brew "suite-sparse"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tmuxp"
brew "trash"
brew "tty-clock"
brew "universal-ctags", args: ["HEAD"]
brew "uv"
brew "vim"
brew "watch"
brew "yarn"
brew "zlib"
brew "zoxide"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "alacritty"
cask "arc"
cask "chromedriver"
cask "claude"
cask "fig"
cask "font-hackgen-nerd"
cask "hammerspoon"
cask "messenger"
cask "notion-calendar"
cask "obsidian"
cask "osxfuse"
cask "raycast"
cask "rstudio"
cask "slack"
cask "visual-studio-code"
vscode "0h7z.vscode-julia-format"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "akosyakov.gitpod-monitor"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "altimateai.vscode-altimate-mcp-server"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "apollographql.vscode-apollo"
vscode "asvetliakov.vscode-neovim"
vscode "augment.vscode-augment"
vscode "ban.spellright"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "coderabbit.coderabbit-vscode"
vscode "codezombiech.gitignore"
vscode "csholmq.excel-to-markdown-table"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dbtlabsinc.dbt"
vscode "deerawan.vscode-dash"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "durzn.brackethighlighter"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eliazbobadilla.python-ultisnippets"
vscode "emilast.logfilehighlighter"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.docker-explorer"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "gitpod.gitpod-flex"
vscode "gitpod.gitpod-remote-ssh"
vscode "goessner.mdmath"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "hridoy.rails-snippets"
vscode "humao.rest-client"
vscode "ics.japanese-proofreading"
vscode "innoverio.vscode-dbt-power-user"
vscode "iulian-radu-at.find-unused-exports"
vscode "janisdd.vscode-edit-csv"
vscode "jnbt.vscode-rufo"
vscode "jspolancor.presentationmode"
vscode "juanallo.vscode-dependency-cruiser"
vscode "juliacomputing.juliahub"
vscode "julialang.language-julia"
vscode "junstyle.vscode-django-support"
vscode "kevinrose.vsc-python-indent"
vscode "labnol.google-apps-script"
vscode "lucasmelin.airflow-snippets"
vscode "magicstack.magicpython"
vscode "marp-team.marp-vscode"
vscode "matangover.mypy"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mhutchie.git-graph"
vscode "mindaro-dev.file-downloader"
vscode "mitchdenny.ecdc"
vscode "moyu.snapcode"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "natqe.reload"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "oouo-diogo-perdigao.docthis"
vscode "patricklee.vsnotes"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "purocean.drawio-preview"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robertz.code-snapshot"
vscode "romanpeshkov.vscode-text-tables"
vscode "rprouse.theme-obsidian"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "samuelcolvin.jinjahtml"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "tal7aouy.rainbow-bracket"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "telesoho.vscode-markdown-paste-image"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/ramya-rao-a/go-outline"
go "golang.org/x/lint/golint"
go "github.com/fatih/gomodifytags"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
