tap "hashicorp/tap"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
brew "automake"
brew "openssl@3"
brew "libssh2"
brew "bat"
brew "berkeley-db", link: true
brew "bottom"
brew "glib"
brew "cheat"
brew "chezmoi"
brew "cmake"
brew "curl"
brew "direnv"
brew "docker"
brew "docutils"
brew "duf"
brew "dust"
brew "erlang"
brew "eza"
brew "fd"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "gron"
brew "harfbuzz"
brew "httpie"
brew "jq"
brew "kubernetes-cli"
brew "libidn2"
brew "little-cms2"
brew "node"
brew "marp-cli"
brew "mise"
brew "neovim"
brew "nghttp2"
brew "openjdk"
brew "peco"
brew "perl"
brew "pre-commit"
brew "procs"
brew "python@3.13"
brew "r"
brew "ripgrep"
brew "rustup"
brew "sd"
brew "selenium-server"
brew "starship"
brew "suite-sparse"
brew "terraform"
brew "tmux"
brew "tmuxp"
brew "trash"
brew "tty-clock"
brew "universal-ctags", args: ["HEAD"]
brew "uv"
brew "watch"
brew "yarn"
brew "zlib"
brew "zoxide"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "alacritty"
cask "arc"
cask "chromedriver"
cask "claude"
cask "cursor"
cask "font-hackgen-nerd"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "messenger"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "raycast"
cask "rstudio"
cask "slack"
cask "visual-studio-code"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/ramya-rao-a/go-outline"
go "golang.org/x/lint/golint"
go "github.com/fatih/gomodifytags"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
