tap "hashicorp/tap"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
brew "automake"
brew "bear"
brew "openssl@3"
brew "libssh2"
brew "bat"
brew "berkeley-db", link: true
brew "bottom"
brew "ccache"
brew "glib"
# brew "cheat"  # Replaced by navi
brew "chezmoi"
brew "choose"          # Modern cut/awk alternative (intuitive syntax)
brew "cmake"
brew "conan"
brew "cppcheck"
brew "curl"
brew "docker"
brew "docutils"
brew "duf"
brew "dust"
brew "erlang"
brew "eza"
brew "fd"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-delta"
brew "difftastic"      # Structural diff tool - syntax-aware diffs ignoring formatting changes
brew "gitleaks"        # Secret detection tool (also managed by mise for project-specific versions)
brew "jj"              # Jujutsu VCS - modern Git alternative with undo and branchless workflow
brew "git-lfs"
brew "glow"
brew "go"
brew "gping"           # Modern ping visualization with graphs
brew "grex"            # Generate regex from examples
brew "gron"
brew "harfbuzz"
brew "httpie"
brew "jq"
brew "jless"           # JSON viewer with syntax highlighting and folding
brew "just"
brew "kubernetes-cli"
brew "lefthook"
brew "libidn2"
brew "little-cms2"
brew "llvm"
brew "node"
brew "marp-cli"
brew "mise"
brew "neovim"
brew "ninja"
brew "nghttp2"
brew "openjdk"
brew "perl"
brew "pre-commit"
brew "procs"
brew "python@3.13"
brew "r"
brew "ripgrep"
brew "rustup"          # Rust toolchain installer (used by mise)
brew "sd"
brew "silicon"         # Create beautiful code screenshot images (Rust-based)
brew "selenium-server"
brew "starship"
brew "suite-sparse"
brew "terraform"
brew "tmux"
brew "zellij"          # Modern tmux alternative (Rust-based, with built-in UI)
brew "trash"
brew "tty-clock"
brew "universal-ctags", args: ["HEAD"]
brew "uv"
brew "watch"
brew "watchexec"       # Modern file watcher with smart defaults (Rust-based)
brew "yazi"            # Blazing fast terminal file manager with async I/O (Rust-based)
brew "yarn"
brew "zlib"
brew "zoxide"
brew "zsh-completions"
brew "sheldon"          # Fast zsh plugin manager (Rust-based)
# Additional useful tools
brew "ghq"            # Git repository manager (unified directory structure)
brew "yq"             # YAML processor (jq for YAML)
brew "tig"            # Git text-mode interface
brew "tokei"          # Code statistics
brew "hyperfine"      # Benchmarking tool
brew "bandwhich"      # Network bandwidth monitor
brew "doggo"          # DNS client (dig alternative)
brew "gitui"           # Blazing fast Git TUI (replacement for lazygit)
brew "atuin"           # Magical shell history sync & search
brew "lazydocker"      # Docker TUI manager
brew "viddy"           # Modern watch command with time machine
brew "navi"            # Interactive cheatsheet tool
brew "xh"              # Fast HTTPie alternative
brew "tealdeer"        # Fast tldr client (Rust implementation)
brew "act"             # Run GitHub Actions locally
brew "age"             # Modern file encryption tool (for chezmoi secrets)
brew "pueue"           # Task queue manager for long-running commands
brew "ouch"            # Universal compression/decompression tool
brew "viu"             # Terminal image viewer
cask "alacritty"  # GPU-accelerated terminal (deprecated 2026-09-01, but still usable)
cask "kitty"      # GPU-accelerated terminal (alternative to alacritty)
cask "ghostty"    # Fast, native, GPU-accelerated terminal (Zig-based, experimental)
cask "wezterm"    # Lua-configurable terminal with SSH integration
cask "orbstack"   # Fast, lightweight Docker Desktop alternative
cask "arc"
cask "chromedriver"
cask "claude"
cask "cursor"
cask "1password"      # 1Password app (optional, enables biometric auth for CLI)
cask "1password-cli"  # 1Password CLI for secrets management with chezmoi
cask "dash"           # API documentation browser
cask "font-hackgen-nerd"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "messenger"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "raycast"
cask "rstudio"
cask "slack"
cask "visual-studio-code"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/ramya-rao-a/go-outline"
go "golang.org/x/lint/golint"
go "github.com/fatih/gomodifytags"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
